const names = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L']
const valusString =
  '000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2019年,99.91%,70528420564.07 ,10313562646.27 ,0.15 ,0.06 ,0.06 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2018年,99.97%,66276054153.09 ,9709560824.46 ,0.15 ,-0.17 ,-0.09 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2017年,99.96%,79980063485.00 ,10644175622.00 ,0.13 ,0.02 ,-0.24 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2016年,99.95%,78506025517.00 ,14042020050.00 ,0.18 ,0.18 ,0.05 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2015年,99.63%,66522990662.00 ,13310740662.00 ,0.20 ,0.26 ,0.38 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2014年,99.60%,52702260000.00 ,9625290000.00 ,0.18 ,0.35 ,0.45 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2013年,99.46%,38929485271.19 ,6649595271.19 ,0.17 ,0.36 ,0.20 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2012年,99.21%,28639375397.24 ,5543120859.08 ,0.19 ,0.13 ,0.42 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2011年,98.29%,25272307006.79 ,3904682771.92 ,0.15 ,-0.21 ,-0.30 ,000625_SZ_EQ,长安汽车,CSF0000001675,重庆长安汽车股份有限公司,深圳证券交易所主板A股,2010年,100.00%,31880665101.70 ,5553599986.55 ,0.17 ,,,,'
let map = []
let index = null
valusString.split(',').forEach((item, i) => {
  index = Math.floor(i / names.length)
  current = i % names.length
  map[index] = map[index] || {}
  map[index][names[current]] = item
})
console.log(JSON.stringify(map))
