export const infos = [
  {
    time: '2020/8/10',
    area: '重庆',
    title: '重庆市人民政府办公厅',
    summary: '关于印发应对新冠肺炎疫情影响促进新能源汽车推广应用若干措施的通知',
    newsList: [
      {
        product: '汽车',
        type: 1,
        typeName: '股票上涨',
        content:
          '这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文'
      },
      {
        product: '汽车',
        type: 1,
        typeName: '股票上涨',
        content:
          '这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文'
      }
    ],
    url: 'http://www.12345678.com1'
  },
  {
    time: '2020/8/9',
    area: '重庆',
    title: '重庆市人民政府办公厅',
    summary: '关于印发应对新冠肺炎疫情影响促进新能源汽车推广应用若干措施的通知',
    newsList: [
      {
        product: '汽车',
        type: -1,
        typeName: '股票下跌',
        content:
          '这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文'
      },
      {
        product: '汽车',
        type: 1,
        typeName: '股票上涨',
        content:
          '这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文'
      }
    ],
    url: 'http://www.12345678.com2'
  },
  {
    time: '2020/8/8',
    area: '成都',
    title: '四川工业和信息化委员会',
    summary: '关于印发《四川省汽车产业链集群化发展三年行动计划（2020-2022年）》',
    newsList: [
      {
        product: '汽车',
        type: -1,
        typeName: '股票下跌',
        content:
          '这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文'
      },
      {
        product: '汽车',
        type: -1,
        typeName: '股票下跌',
        content:
          '这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文'
      }
    ],
    url: 'http://www.12345678.com3'
  },
  {
    time: '2020/8/7',
    area: '重庆',
    title: '重庆市人民政府办公厅',
    summary: '关于印发应对新冠肺炎疫情影响促进新能源汽车推广应用若干措施的通知',
    newsList: [
      {
        product: '汽车',
        type: 1,
        typeName: '股票上涨',
        content:
          '这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文'
      },
      {
        product: '汽车',
        type: 1,
        typeName: '股票上涨',
        content:
          '这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文这是正文'
      }
    ],
    url: 'http://www.12345678.com4'
  }
]
