export const graph = {
  nodes: [
    {
      id: '1',
      name: '风险内容1',
      category: 0
    },
    {
      id: '2',
      name: '风险内容2',
      category: 1
    },
    {
      id: '3',
      name: '风险内容3',
      category: 2
    },
    {
      id: '4',
      name: '风险内容4',
      category: 0
    },
    {
      id: '5',
      name: '风险内容5',
      category: 1
    },
    {
      id: '6',
      name: '风险内容6',
      category: 2
    },
    {
      id: '7',
      name: '风险内容7',
      category: 0
    },
    {
      id: '8',
      name: '风险内容8',
      category: 1
    },
    {
      id: '9',
      name: '风险内容9',
      category: 2
    },
    {
      id: '10',
      name: '风险内容10',
      category: 0
    },
    {
      id: '11',
      name: '风险内容11',
      category: 1
    },
    {
      id: '12',
      name: '风险内容12',
      category: 2
    },
    {
      id: '13',
      name: '风险内容13',
      category: 0
    },
    {
      id: '14',
      name: '风险内容14',
      category: 1
    },
    {
      id: '15',
      name: '风险内容15',
      category: 2
    }
  ],
  links: []
}

export const tableData = [
  { name: '总资产增长率', last: -10.810689076, change: -17.696241466, ratio: -2.57005400056218 },
  { name: '总负债增长率', last: -6.414767126, change: -28.80082076475, ratio: -1.2865519412004 },
  { name: '资产合计', last: 30966672698.048, change: 9148396299.26675, ratio: 0.419299679409037 },
  { name: '资产负债率', last: 67.15208, change: 10.754355, ratio: 0.190687744940066 },
  { name: '债务权益比', last: 75.37124, change: 31.944315, ratio: 0.735587771871944 },
  { name: '应收账款周转率', last: 1.562711388, change: -0.82608205325, ratio: -0.345815606734809 },
  { name: '应付账款周转率', last: 1.451455148, change: -0.753237886999999, ratio: -0.341652046358463 },
  { name: '营业总收入', last: 11847952197.38, change: 1458168761.765, ratio: 0.140346405755346 },
  { name: '营业收入增长率', last: -11.784430634, change: -21.90877323025, ratio: -2.16396995873736 },
  { name: '营业利润率', last: -5.85808, change: -8.8421675, ratio: -2.96310597460698 },
  { name: '营业利润', last: -106198543.386, change: -595155040.0835, ratio: -1.21719425777811 },
  { name: '现金周转率', last: -9.04958, change: -14.090255, ratio: -2.79531114384482 },
  { name: '现金及现金等价物净增加额', last: -2446051357.514, change: -1174756292.3415, ratio: -0.924062654315503 },
  { name: '现金比率', last: 24.0771, change: -10.5152625, ratio: -0.303976419650436 },
  { name: '息税前利润率', last: -15.45636, change: -6.385585, ratio: -0.703973475254319 },
  { name: '息税前利润(EBIT)', last: -583553917.08, change: -710971734.86375, ratio: -5.57984548181787 },
  { name: '投资活动产生的现金流量净额', last: -2994797240.984, change: -1671467874.8915, ratio: -1.2630777474749 },
  { name: '所有者权益增长率', last: -20.133422306, change: -15.420912646, ratio: -3.27233549819397 },
  { name: '速动比率', last: 69.70528, change: -26.9203075, ratio: -0.278604334488523 },
  { name: '税息折旧及摊销前利润率', last: -9.9178, change: -4.79655, ratio: -0.936597510373444 },
  { name: '税息折旧及摊销前利润(EBITDA)', last: -76498193.244, change: -578741263.72525, ratio: -1.15231308850254 },
  { name: '税前利润', last: -741328721.924, change: -937798535.389, ratio: -4.77324490133984 },
  { name: '权益乘数', last: 342.28824, change: 93.31004, ratio: 0.3747719278234 },
  { name: '平均资产收益率(ROA)', last: -7.95280411, change: -6.1396706675, ratio: -3.38622107098441 },
  { name: '平均净资产收益率(ROE)', last: -27.798480216, change: -19.1833333285, ratio: -2.22669834641284 },
  { name: '毛利润增长率', last: -7.8727877275, change: -3.89603588625, ratio: -0.979703044539327 },
  { name: '毛利润', last: 1335756791.264, change: -259177346.631, ratio: -0.162500344354698 },
  { name: '毛利率', last: 12.036775, change: -4.0116375, ratio: -0.249970986226831 },
  { name: '流动比率', last: 111.52998, change: -19.2291825, ratio: -0.147058012091505 },
  { name: '扣除非经常性损益后净利润', last: -925952837.632, change: -869295805.882, ratio: -15.3431229810587 },
  { name: '净利润增长率', last: 29.9322305975, change: 49.7913276075, ratio: -2.5072301919079 },
  { name: '净利润', last: -751988108.656, change: -877074443.27475, ratio: -7.01175269023576 },
  { name: '净利率', last: -22.5966, change: -13.4304375, ratio: -1.46521922342092 },
  { name: '经营活动产生的现金流量净额', last: -1755887920.47, change: -1355436770.68625, ratio: -3.38477432620235 },
  { name: '固定资产周转率', last: 2.981815998, change: -0.5269596095, ratio: -0.150183331294719 },
  { name: '股东权益合计', last: 11827692694.358, change: 2490920324.33675, ratio: 0.266786018296286 },
  { name: '负债权益比', last: 242.28824, change: 93.31004, ratio: 0.626333517252859 },
  { name: '负债合计', last: 19138980003.69, change: 6657475974.93, ratio: 0.533387319315828 },
  { name: '存货周转率', last: 4.971664894, change: -3.0179694635, ratio: -0.377735616983146 },
  { name: '筹资活动产生的现金流量净额', last: 2304224569.03, change: 1840100352.96875, ratio: 3.96467214872907 }
]

export const bond = {
  value: 16,
  ratio: 2.38,
  list: ['企业1', '企业2', '企业3', '企业4']
}
export const stock = {
  value: 8,
  ratio: 1.31,
  list: ['企业1', '企业2', '企业3', '企业4']
}

export const barData = [
  { time: '2020.4', value: 150 },
  { time: '2020.5', value: 52 },
  { time: '2020.6', value: 125 },
  { time: '2020.7', value: 1150 },
  { time: '2020.8', value: 20 },
  { time: '2020.9', value: 842 },
  { time: '2020.11', value: 560 }
]

export const lineData = [
  { time: '2020.4', value: 100, value1: 50 },
  { time: '2020.5', value: 150, value1: 38 },
  { time: '2020.6', value: 125, value1: 98 },
  { time: '2020.7', value: 1150, value1: 150 },
  { time: '2020.8', value: 20, value1: 86 },
  { time: '2020.9', value: 842, value1: 82 },
  { time: '2020.11', value: 560, value1: 23 }
]
